In [1]:
!pip insatll pandas

ERROR: unknown command "insatll" - maybe you meant "install"

In [2]:
!pip install pandas

Collecting pandas
  Downloading pandas-2.3.2-cp312-cp312-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\pypre\onedrive\desktop\python_ml\venv\lib\site-packages (from pandas) (2.3.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\pypre\onedrive\desktop\python_ml\venv\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\pypre\onedrive\desktop\python_ml\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.2-cp312-cp312-win_amd64.whl (11.0 MB)
   ---------------------------------------- 0.0/11.0 MB ? eta -:--:--
   -- ------------------------------------- 0.8/11.0 MB 6.7 MB/s eta 0:00:02
   ---------------------- ----------------- 6.3/11.0 MB 22.7 MB/s eta 0:00:01
   ---------------------------------------  10.7/11.0 MB 22.4 MB/s eta 0:00:01
   ---------------------------------------- 11.0/11.0 MB 22.2 MB/s eta 0:00:00
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, pandas

   ---------------------------------------- 0/3 [pytz]
   ---------------------------------------- 0/3 [pytz]
   ------------- -------------------------- 1/3 [tzdata]
   ------------- -------------------------- 1/3 [tzdata]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   ---------------------------------------- 3/3 [pandas]

Successfully installed pandas-2.3.2 pytz-2025.2 tzdata-2025.2

In [7]:
import pandas as pd
data = [10,20,30]
index = ['a','b','c']

pd.Series(data,index)

a    10
b    20
c    30
dtype: int64

In [ ]:
import pandas as pd
# data = {"a": 1,"b":2,"c":3,"d":4}
# series_data = pd.Series(data)
# print(series_data)
data = [10,20,30]
index=["a","b","c"]
pd.Series(data,index)

a    10
b    20
c    30
dtype: int64

In [10]:
data ={
    "name": ["pal","deep","vansh","vaja"],
    "age": [21,20,21,22],
    "gendar": ["male","male","female","male"],
    "city" : ["ahem","surat","rajkot","porbandar"]
}

pd.DataFrame(data)

    name  age  gendar       city
0    pal   21    male       ahem
1   deep   20    male      surat
2  vansh   21  female     rajkot
3   vaja   22    male  porbandar

In [17]:
pf=pd.read_csv("sales_data.csv")
pf.head(5)
pf.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [27]:
import pandas as pd
data ={
    "name": ["pal","deep","vansh","vaja"],
    "age": [21,20,21,22],
    "gendar": ["male","male","female","male"],
    "city" : ["ahem","surat","rajkot","porbandar"]
}
df = pd.DataFrame(data)
df

    name  age  gendar       city
0    pal   21    male       ahem
1   deep   20    male      surat
2  vansh   21  female     rajkot
3   vaja   22    male  porbandar

In [33]:
df.loc[0][2]

C:\Users\pypre\AppData\Local\Temp\ipykernel_7752\2880214942.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][2]

'male'

In [34]:
df.iloc[0][2]

C:\Users\pypre\AppData\Local\Temp\ipykernel_7752\2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'male'

In [35]:
df

    name  age  gendar       city
0    pal   21    male       ahem
1   deep   20    male      surat
2  vansh   21  female     rajkot
3   vaja   22    male  porbandar

In [45]:
df["salary"]=[100000,20000,153153,65256]
df

    name  age  gendar       city  salary
0    pal   21    male       ahem  100000
1   deep   20    male      surat   20000
2  vansh   21  female     rajkot  153153
3   vaja   22    male  porbandar   65256

In [46]:
df.drop("salary",axis=1,inplace=True)

    name  age  gendar       city
0    pal   21    male       ahem
1   deep   20    male      surat
2  vansh   21  female     rajkot
3   vaja   22    male  porbandar

In [51]:
df['grade']=df["age"].astype(int)
df.head()

    name  age  gendar       city  grade
0    pal   21    male       ahem     21
1   deep   20    male      surat     20
2  vansh   21  female     rajkot     21
3   vaja   22    male  porbandar     22